dataframe

In [ ]:
import pandas as pd

#nomor 1

mydf = pd.DataFrame({
    'athlete' : ['michael phelps', 'michael phelps', 'michael phelps', 
                'natalie couglin', 'aleksey nemov'],
    'age' : [23, 19, 27, 25, 24],
    'country' : ['US', 'Canada', 'US', 'Norway', 'China'],
    'year' : [2008, 2004, 2012, 2008, 2000],
    'gold medals': [8,6,4,1,2]
})
mydf

           athlete  age country  year  gold medals
0   michael phelps   23      US  2008            8
1   michael phelps   19  Canada  2004            6
2   michael phelps   27      US  2012            4
3  natalie couglin   25  Norway  2008            1
4    aleksey nemov   24   China  2000            2

In [7]:
#nomor 2
mydf.columns

Index(['athlete', 'age', 'country', 'year', 'gold medals'], dtype='object')

In [4]:
#nomor 3
mydf[['athlete', 'country', 'year']]

           athlete country  year
0   michael phelps      US  2008
1   michael phelps  Canada  2004
2   michael phelps      US  2012
3  natalie couglin  Norway  2008
4    aleksey nemov   China  2000

In [8]:
#nomor 4
mydf.iloc[0:3] #data 3 baris pertama

          athlete  age country  year  gold medals
0  michael phelps   23      US  2008            8
1  michael phelps   19  Canada  2004            6
2  michael phelps   27      US  2012            4

conditional

In [25]:
import pandas as pd

mydf2 = pd.DataFrame({
    'athlete' : ['michael phelps', 'michael phelps', 'michael phelps', 
                'natalie couglin', 'aleksey nemov'],
    'age' : [23, 19, 27, 25, 24],
    'country' : ['US', 'Canada', 'US', 'Norway', 'China'],
    'year' : [2008, 2004, 2012, 2008, 2000],
    'gold medals': [8,6,4,1,2]
})
mydf2

           athlete  age country  year  gold medals
0   michael phelps   23      US  2008            8
1   michael phelps   19  Canada  2004            6
2   michael phelps   27      US  2012            4
3  natalie couglin   25  Norway  2008            1
4    aleksey nemov   24   China  2000            2

In [26]:
#nomor 1: tampilin athlete yang dari US

mydf2.loc[mydf2['country'] == 'US', 'athlete']

0    michael phelps
2    michael phelps
Name: athlete, dtype: object

In [27]:
#nomor 2: tampilin athlete yang bergabung tahun 2008

mydf2.loc[mydf2['year'] == 2008, 'athlete']

0     michael phelps
3    natalie couglin
Name: athlete, dtype: object

In [28]:
#nomor 3: hapus athlete yang berumur 25 tahun dan berasal dari norway

index_to_drop = mydf2.loc[(mydf2['age'] >= 25) & (mydf2['country'] == 'Norway')].index
mydf2.drop(index_to_drop, inplace = True)
mydf2

          athlete  age country  year  gold medals
0  michael phelps   23      US  2008            8
1  michael phelps   19  Canada  2004            6
2  michael phelps   27      US  2012            4
4   aleksey nemov   24   China  2000            2

In [29]:
#nambahin kolom

mydf2['silver medal'] = [0,0,2,1]
mydf2['bronze medal'] = [0,2,0,3]
mydf2

          athlete  age country  year  gold medals  silver medal  bronze medal
0  michael phelps   23      US  2008            8             0             0
1  michael phelps   19  Canada  2004            6             0             2
2  michael phelps   27      US  2012            4             2             0
4   aleksey nemov   24   China  2000            2             1             3